In [3]:
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd
%matplotlib inline

In [16]:
csv = pd.read_csv('https://raw.githubusercontent.com/kneeks/IS-362/master/project_1/project1.csv', index_col=[0,1])
csv

<div>
<style>
    .dataframe thead tr:only-child th {
        text-align: right;
    }

    .dataframe thead th {
        text-align: left;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th></th>
      <th>Los Angeles</th>
      <th>Phoenix</th>
      <th>San Diego</th>
      <th>San Fransisco</th>
      <th>Seattle</th>
    </tr>
    <tr>
      <th></th>
      <th>Unnamed: 1</th>
      <th></th>
      <th></th>
      <th></th>
      <th></th>
      <th></th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>ALASKA</th>
      <th>on time</th>
      <td>497.0</td>
      <td>221.0</td>
      <td>212.0</td>
      <td>503.0</td>
      <td>1841.0</td>
    </tr>
    <tr>
      <th rowspan="2" valign="top">NaN</th>
      <th>delayed</th>
      <td>62.0</td>
      <td>12.0</td>
      <td>20.0</td>
      <td>102.0</td>
      <td>305.0</td>
    </tr>
    <tr>
      <th>NaN</th>
      <td>NaN</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>NaN</td>
    </tr>
    <tr>
      <th>AM WEST</th>
      <th>on time</th>
      <td>694.0</td>
      <td>4840.0</td>
      <td>383.0</td>
      <td>320.0</td>
      <td>201.0</td>
    </tr>
    <tr>
      <th>NaN</th>
      <th>delayed</th>
      <td>117.0</td>
      <td>415.0</td>
      <td>65.0</td>
      <td>129.0</td>
      <td>61.0</td>
    </tr>
  </tbody>
</table>
</div>

In [17]:
csv = pd.DataFrame.dropna(csv)
csv

<div>
<style>
    .dataframe thead tr:only-child th {
        text-align: right;
    }

    .dataframe thead th {
        text-align: left;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th></th>
      <th>Los Angeles</th>
      <th>Phoenix</th>
      <th>San Diego</th>
      <th>San Fransisco</th>
      <th>Seattle</th>
    </tr>
    <tr>
      <th></th>
      <th>Unnamed: 1</th>
      <th></th>
      <th></th>
      <th></th>
      <th></th>
      <th></th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>ALASKA</th>
      <th>on time</th>
      <td>497.0</td>
      <td>221.0</td>
      <td>212.0</td>
      <td>503.0</td>
      <td>1841.0</td>
    </tr>
    <tr>
      <th>NaN</th>
      <th>delayed</th>
      <td>62.0</td>
      <td>12.0</td>
      <td>20.0</td>
      <td>102.0</td>
      <td>305.0</td>
    </tr>
    <tr>
      <th>AM WEST</th>
      <th>on time</th>
      <td>694.0</td>
      <td>4840.0</td>
      <td>383.0</td>
      <td>320.0</td>
      <td>201.0</td>
    </tr>
    <tr>
      <th>NaN</th>
      <th>delayed</th>
      <td>117.0</td>
      <td>415.0</td>
      <td>65.0</td>
      <td>129.0</td>
      <td>61.0</td>
    </tr>
  </tbody>
</table>
</div>

Lets find the total of all the columns combined, they hard and the easy way.

In [18]:
tot = csv.Phoenix + csv['San Fransisco'] + csv.Seattle + csv['San Diego'] + csv['Los Angeles']
tot

         Unnamed: 1
ALASKA   on time       3274.0
NaN      delayed        501.0
AM WEST  on time       6438.0
NaN      delayed        787.0
dtype: float64

In [19]:
c = csv.sum(axis=1)
c

         Unnamed: 1
ALASKA   on time       3274.0
NaN      delayed        501.0
AM WEST  on time       6438.0
NaN      delayed        787.0
dtype: float64

Next we want to figure out the arrival delays for the two airlines.

In [20]:
alaska = c[1]/c[0]*100
alaska

15.302382406841783

In [21]:
amw = c[3]/c[2]*100
amw

12.224293258776017

To conclude this data Alaska airlines has a higher percentage of delays then AM West.